In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
frame["year*pop"]=frame["year"]*frame["pop"]

In [5]:
frame

    state  year  pop  year*pop
0    Ohio  2000  1.5    3000.0
1    Ohio  2001  1.7    3401.7
2    Ohio  2002  3.6    7207.2
3  Nevada  2001  2.4    4802.4
4  Nevada  2002  2.9    5805.8
5  Nevada  2003  3.2    6409.6

In [6]:
frame[frame["year*pop"]>5000]

    state  year  pop  year*pop
2    Ohio  2002  3.6    7207.2
4  Nevada  2002  2.9    5805.8
5  Nevada  2003  3.2    6409.6

In [7]:
frame["id"]=["A123","223","233","A333","A222","A322"]

In [8]:
frame

    state  year  pop  year*pop    id
0    Ohio  2000  1.5    3000.0  A123
1    Ohio  2001  1.7    3401.7   223
2    Ohio  2002  3.6    7207.2   233
3  Nevada  2001  2.4    4802.4  A333
4  Nevada  2002  2.9    5805.8  A222
5  Nevada  2003  3.2    6409.6  A322

In [9]:
id_=["A123","A223","A233","A333","A222","A322"]

In [10]:
df2 = pd.DataFrame({'id': ["A123","A223","A233","A333","A222","A322"], 'data2': range(6)})

In [11]:
#检查与数据库中车号关联后仍找不到的车号，打印出来
frame[pd.isnull(pd.merge(frame, df2, on='id',how='left')['data2'])]

  state  year  pop  year*pop   id
1  Ohio  2001  1.7    3401.7  223
2  Ohio  2002  3.6    7207.2  233

In [12]:
frame

    state  year  pop  year*pop    id
0    Ohio  2000  1.5    3000.0  A123
1    Ohio  2001  1.7    3401.7   223
2    Ohio  2002  3.6    7207.2   233
3  Nevada  2001  2.4    4802.4  A333
4  Nevada  2002  2.9    5805.8  A222
5  Nevada  2003  3.2    6409.6  A322

In [13]:
df3=pd.DataFrame({'id': ["123F","223F","233F","3333F","2222F","322D"], 'data2': range(6)})

In [14]:
df3['id'].map(len)<6

0    True
1    True
2    True
3    True
4    True
5    True
Name: id, dtype: bool

In [15]:
bool_=df3['id'].str.endswith('F')|df3['id'].str.endswith('D')
bool_
df3[bool_]

0    True
1    True
2    True
3    True
4    True
5    True
Name: id, dtype: bool

      id  data2
0   123F      0
1   223F      1
2   233F      2
3  3333F      3
4  2222F      4
5   322D      5

In [16]:
df3

      id  data2
0   123F      0
1   223F      1
2   233F      2
3  3333F      3
4  2222F      4
5   322D      5

In [17]:
df3=pd.DataFrame({'id': ["123  F","223  F","233   F","3333F","2222F","322D"], 'data2': range(6)})

In [18]:
df3

        id  data2
0   123  F      0
1   223  F      1
2  233   F      2
3    3333F      3
4    2222F      4
5     322D      5

In [19]:
df3["id"].str.replace(" ","")

0     123F
1     223F
2     233F
3    3333F
4    2222F
5     322D
Name: id, dtype: object

In [20]:
df3

        id  data2
0   123  F      0
1   223  F      1
2  233   F      2
3    3333F      3
4    2222F      4
5     322D      5

In [21]:
list=[1*6]

In [37]:
np.random.normal(200,6.32,20)

array([206.5057573 , 198.96115443, 191.14334061, 189.13878644,
       199.09722065, 194.29857673, 194.90056617, 206.97124182,
       193.92270315, 198.83213515, 197.38247779, 196.61830771,
       206.90333279, 205.25036578, 204.19632838, 202.22702048,
       199.29838825, 196.94983143, 193.59630345, 184.30596337])